# Задача 20: В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность. В случае с английским алфавитом очки распределяются так:
# ● A, E, I, O, U, L, N, S, T, R – 1 очко;
# ● D, G – 2 очка;
# ● B, C, M, P – 3 очка;
# ● F, H, V, W, Y – 4 очка;
# ● K – 5 очков;
# ● J, X – 8 очков;
# ● Q, Z – 10 очков.
# А русские буквы оцениваются так:
# ● А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# ● Д, К, Л, М, П, У – 2 очка;
# ● Б, Г, Ё, Ь, Я – 3 очка;
# ● Й, Ы – 4 очка;
# ● Ж, З, Х, Ц, Ч – 5 очков;
# ● Ш, Э, Ю – 8 очков;
# ● Ф, Щ, Ъ – 10 очков.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова.
# Будем считать, что на вход подается только одно слово, которое содержит либо только английские,
# либо только русские буквы.

def Lang_Definition(str):
    lang = ""
    if str[0] in ["А", "Б", "В", "Г", "Д", "Е", "Ë", "Ж", "З", "И", "Й", "К", "Л", "М", "Н", "О", "П", "Р", "С", "Т",
                  "У", "Ф", "Х", "Ц", "Ч", "Ш", "Щ", "Ъ", "Ы", "Ь", "Э", "Ю", "Я"]:
        lang = "ru"
    elif str[0] in ["A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "O", "P", "Q", "R", "S", "U",
                    "V", "W", "X", "Y", "Z"]:
        lang = "eng"
    return lang


word = input("Введите слово: ")
word = word.upper()

language = Lang_Definition(word)
score = 0

if language == "ru":
    for i in word:
        if i in ["А", "В", "Е", "И", "Н", "О", "Р", "С", "Т"]:
            score += 1
        elif i in ["Д", "К", "Л", "М", "П", "У"]:
            score += 2
        elif i in ["Б", "Г", "Ё", "Ь", "Я"]:
            score += 3
        elif i in ["Й", "Ы"]:
            score += 4
        elif i in ["Ж", "З", "Х", "Ц", "Ч"]:
            score += 5
        elif i in ["Ш", "Э", "Ю"]:
            score += 8
        elif i in ["Ф", "Щ", "Ъ"]:
            score += 10
elif language == "eng":
    for i in word:
        if i in ["A", "E", "I", "O", "U", "L", "N", "S", "T", "R"]:
            score = score + 1
        elif i in ["D", "G"]:
            score = score + 2
        elif i in ["B", "C", "M", "P"]:
            score = score + 3
        elif i in ["F", "H", "V", "W", "Y"]:
            score = score + 4
        elif i in ["K"]:
            score = score + 5
        elif i in ["J", "X"]:
            score = score + 8
        elif i in ["Q", "Z"]:
            score = score + 10

print(f'Слово {word} в игре Scrabble "стоит" - {score} очков')
